// 2. **Сортировка***
    
//     На вход функции подается массив [4, 7, 3, 1, 9, 0,  2, 8, 5, 6], нужно вывести отсортированный массив: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


const sortArray = (arr) => {
    for (let i = 0; i < arr.length - 1; i++) {
        for (let j = 0; j < arr.length - i - 1; j++) {
            if (arr[j] > arr[j + 1]) {
                let temp = arr[j]
                arr[j] = arr[j + 1]
                arr[j + 1] = temp
            }
        }
    }
    return arr;
}

let array = [4, 7, 3, 1, 9, 0, 2, 8, 5, 6]
console.log(sortArray(array))
console.log(array.length)